Revit 2027 API
BuiltInFailures.WallFailures.FailedConvertWallToPanel Property
 Unable to convert wall to panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedConvertWallToPanel { get; }
Public Shared ReadOnly Property FailedConvertWallToPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedConvertWallToPanel {
	FailureDefinitionId^ get ();
}
static member FailedConvertWallToPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace